{
  "cmp-buffer": {
    "branch": "main"
  },
  "cmp-nvim-lsp": {
    "branch": "main"
  },
  "cmp-path": {
    "branch": "main"
  },
  "gitsigns.nvim": {
    "branch": "main"
  },
  "harpoon": {
    "branch": "master"
  },
  "indent-blankline.nvim": {
    "branch": "master"
  },
  "lazy.nvim": {
    "branch": "main"
  },
  "lua-async-await": {
    "branch": "main"
  },
  "lualine.nvim": {
    "branch": "master"
  },
  "mason-lspconfig.nvim": {
    "branch": "main"
  },
  "mason-null-ls.nvim": {
    "branch": "main"
  },
  "mason-nvim-dap.nvim": {
    "branch": "main"
  },
  "mason.nvim": {
    "branch": "main"
  },
  "none-ls.nvim": {
    "branch": "main"
  },
  "nui.nvim": {
    "branch": "main"
  },
  "nvim-autopairs": {
    "branch": "master"
  },
  "nvim-cmp": {
    "branch": "main"
  },
  "nvim-dap": {
    "branch": "master"
  },
  "nvim-java": {
    "branch": "main"
  },
  "nvim-java-core": {
    "branch": "main"
  },
  "nvim-java-dap": {
    "branch": "main"
  },
  "nvim-java-refactor": {
    "branch": "main"
  },
  "nvim-java-test": {
    "branch": "main"
  },
  "nvim-lspconfig": {
    "branch": "master"
  },
  "nvim-tree.lua": {
    "branch": "master"
  },
  "nvim-treesitter": {
    "branch": "master"
  },
  "nvim-ts-autotag": {
    "branch": "main"
  },
  "nvim-web-devicons": {
    "branch": "master"
  },
  "plenary.nvim": {
    "branch": "master"
  },
  "spring-boot.nvim": {
    "branch": "main"
  },
  "telescope-file-browser.nvim": {
    "branch": "master"
  },
  "telescope-fzf-native.nvim": {
    "branch": "main"
  },
  "telescope-ui-select.nvim": {
    "branch": "master"
  },
  "telescope.nvim": {
    "branch": "master"
  },
  "toggleterm.nvim": {
    "branch": "main"
  },
  "vim-fugitive": {
    "branch": "master"
  },
  "vscode.nvim": {
    "branch": "main"
  },
  "which-key.nvim": {
    "branch": "main"
  }
}
